
###  Terraform Plan

<details><summary>Click to expand</summary>

```hcl
[command]/home/runner/work/_temp/f2c03f31-01f7-4a5f-8693-c1193944e9a5/terraform-bin show -no-color tfplan
2025-10-02T13:31:09.935Z [INFO]  Terraform version: 1.6.6
2025-10-02T13:31:09.935Z [INFO]  Go runtime version: go1.21.5
2025-10-02T13:31:09.935Z [INFO]  CLI args: []string{"/home/runner/work/_temp/f2c03f31-01f7-4a5f-8693-c1193944e9a5/terraform-bin", "show", "-no-color", "tfplan"}
2025-10-02T13:31:09.935Z [INFO]  CLI command args: []string{"show", "-no-color", "tfplan"}
2025-10-02T13:31:10.030Z [INFO]  provider: configuring client automatic mTLS
2025-10-02T13:31:10.073Z [INFO]  provider.terraform-provider-google_v6.50.0_x5: configuring server automatic mTLS: timestamp=2025-10-02T13:31:10.073Z

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.main will be created
  + resource "google_compute_network" "main" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "multi-tenant-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "tmam-practical"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.tenant1.google_compute_firewall.this will be created
  + resource "google_compute_firewall" "this" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "tenant1-fw"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "tmam-practical"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "tenant1-web",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # module.tenant1.google_compute_instance.this will be created
  + resource "google_compute_instance" "this" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + creation_timestamp      = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "tenant"                     = "tenant1"
        }
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + labels                  = {
          + "tenant" = "tenant1"
        }
      + machine_type            = "e2-medium"
      + metadata                = {
          + "ssh-keys" = "gcpuser:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBLLvxDJJwCJq8uuKTlPmOI9sYvUo1dYjiVdazxSEbZ2+/uV1BHoXCdevUnfaBkD8eDbZ93M+PiNLoGhR5EnRPYM= abu@abu-VirtualBox"
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash -x
            exec > /var/log/startup-script.log 2>&1
            
            # Update system
            apt update
            apt upgrade -y
            
            # Install dependencies
            apt install -y gnupg2 ca-certificates lsb-release apt-transport-https software-properties-common curl unzip git
            
            # Add PHP repository (Sury, latest PHP packages)
            curl -fsSL https://packages.sury.org/php/apt.gpg | gpg --dearmor -o /etc/apt/trusted.gpg.d/sury.gpg
            echo "deb https://packages.sury.org/php $(lsb_release -sc) main" | tee /etc/apt/sources.list.d/php.list
            
            apt update
            apt upgrade -y
            
            # Install PHP + extensions + Nginx + Composer
            apt install -y nginx php8.3-cli php8.3-fpm php8.3-mbstring php8.3-mysql php8.3-xml php8.3-curl php8.3-sqlite3
            
            # Configure Nginx for Laravel
            cat > /etc/nginx/sites-available/laravel <<'EOF'
            server {
                listen 80;
                server_name _;
                root /var/www/laravel/public;
            
                add_header X-Frame-Options "SAMEORIGIN";
                add_header X-Content-Type-Options "nosniff";
            
                index index.php index.html;
            
                location / {
                    try_files $uri $uri/ /index.php?$query_string;
                }
            
                location ~ \.php$ {
                    include snippets/fastcgi-php.conf;
                    fastcgi_pass unix:/var/run/php/php8.3-fpm.sock;
                    fastcgi_param SCRIPT_FILENAME $document_root$fastcgi_script_name;
                    include fastcgi_params;
                }
            
                location ~ /\.ht {
                    deny all;
                }
            }
            EOF
            
            ln -s /etc/nginx/sites-available/laravel /etc/nginx/sites-enabled/
            rm -f /etc/nginx/sites-enabled/default
            
            # Install Composer globally
            export HOME=/root
            export COMPOSER_HOME=/root/.config/composer
            export COMPOSER_ALLOW_SUPERUSER=1
            mkdir -p /usr/src
            curl -sS https://getcomposer.org/installer -o /usr/src/composer-setup.php
            php /usr/src/composer-setup.php --install-dir=/usr/local/bin --filename=composer
            chmod 755 /usr/local/bin/composer
            
            # Verify Composer installation
            /usr/local/bin/composer --version
            
            # Deploy Laravel
            mkdir -p /var/www
            /usr/local/bin/composer create-project --prefer-dist --no-interaction laravel/laravel /var/www/laravel
            
            # Set permissions
            chown -R www-data:www-data /var/www/laravel
            chmod -R 755 /var/www/laravel
            
            # Restart services
            systemctl enable nginx php8.3-fpm
            systemctl restart nginx php8.3-fpm
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "tenant1-webserver"
      + project                 = "tmam-practical"
      + self_link               = (known after apply)
      + tags                    = [
          + "tenant1-web",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "tenant"                     = "tenant1"
        }
      + zone                    = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "debian-cloud/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = (known after apply)
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

  # module.tenant1.google_compute_subnetwork.this will be created
  + resource "google_compute_subnetwork" "this" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "tenant1-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "tmam-practical"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)
    }

  # module.tenant2.google_compute_firewall.this will be created
  + resource "google_compute_firewall" "this" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "tenant2-fw"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "tmam-practical"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "tenant2-web",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # module.tenant2.google_compute_instance.this will be created
  + resource "google_compute_instance" "this" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + creation_timestamp      = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "tenant"                     = "tenant2"
        }
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + labels                  = {
          + "tenant" = "tenant2"
        }
      + machine_type            = "e2-medium"
      + metadata                = {
          + "ssh-keys" = "gcpuser:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBLLvxDJJwCJq8uuKTlPmOI9sYvUo1dYjiVdazxSEbZ2+/uV1BHoXCdevUnfaBkD8eDbZ93M+PiNLoGhR5EnRPYM= abu@abu-VirtualBox"
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash -x
            exec > /var/log/startup-script.log 2>&1
            
            # Update system
            apt update
            apt upgrade -y
            
            # Install dependencies
            apt install -y gnupg2 ca-certificates lsb-release apt-transport-https software-properties-common curl unzip git
            
            # Add PHP repository (Sury, latest PHP packages)
            curl -fsSL https://packages.sury.org/php/apt.gpg | gpg --dearmor -o /etc/apt/trusted.gpg.d/sury.gpg
            echo "deb https://packages.sury.org/php $(lsb_release -sc) main" | tee /etc/apt/sources.list.d/php.list
            
            apt update
            apt upgrade -y
            
            # Install PHP + extensions + Nginx + Composer
            apt install -y nginx php8.3-cli php8.3-fpm php8.3-mbstring php8.3-mysql php8.3-xml php8.3-curl php8.3-sqlite3
            
            # Configure Nginx for Laravel
            cat > /etc/nginx/sites-available/laravel <<'EOF'
            server {
                listen 80;
                server_name _;
                root /var/www/laravel/public;
            
                add_header X-Frame-Options "SAMEORIGIN";
                add_header X-Content-Type-Options "nosniff";
            
                index index.php index.html;
            
                location / {
                    try_files $uri $uri/ /index.php?$query_string;
                }
            
                location ~ \.php$ {
                    include snippets/fastcgi-php.conf;
                    fastcgi_pass unix:/var/run/php/php8.3-fpm.sock;
                    fastcgi_param SCRIPT_FILENAME $document_root$fastcgi_script_name;
                    include fastcgi_params;
                }
            
                location ~ /\.ht {
                    deny all;
                }
            }
            EOF
            
            ln -s /etc/nginx/sites-available/laravel /etc/nginx/sites-enabled/
            rm -f /etc/nginx/sites-enabled/default
            
            # Install Composer globally
            export HOME=/root
            export COMPOSER_HOME=/root/.config/composer
            export COMPOSER_ALLOW_SUPERUSER=1
            mkdir -p /usr/src
            curl -sS https://getcomposer.org/installer -o /usr/src/composer-setup.php
            php /usr/src/composer-setup.php --install-dir=/usr/local/bin --filename=composer
            chmod 755 /usr/local/bin/composer
            
            # Verify Composer installation
            /usr/local/bin/composer --version
            
            # Deploy Laravel
            mkdir -p /var/www
            /usr/local/bin/composer create-project --prefer-dist --no-interaction laravel/laravel /var/www/laravel
            
            # Set permissions
            chown -R www-data:www-data /var/www/laravel
            chmod -R 755 /var/www/laravel
            
            # Restart services
            systemctl enable nginx php8.3-fpm
            systemctl restart nginx php8.3-fpm
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "tenant2-webserver"
      + project                 = "tmam-practical"
      + self_link               = (known after apply)
      + tags                    = [
          + "tenant2-web",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "tenant"                     = "tenant2"
        }
      + zone                    = "us-central1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "debian-cloud/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = (known after apply)
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

  # module.tenant2.google_compute_subnetwork.this will be created
  + resource "google_compute_subnetwork" "this" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.2.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "tenant2-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "tmam-practical"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + tenant1_instance_ip = (known after apply)
  + tenant2_instance_ip = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_compute_network.main will be created%0A  + resource "google_compute_network" "main" {%0A      + auto_create_subnetworks                   = false%0A      + bgp_always_compare_med                    = (known after apply)%0A      + bgp_best_path_selection_mode              = (known after apply)%0A      + bgp_inter_region_cost                     = (known after apply)%0A      + delete_default_routes_on_create           = false%0A      + gateway_ipv4                              = (known after apply)%0A      + id                                        = (known after apply)%0A      + internal_ipv6_range                       = (known after apply)%0A      + mtu                                       = (known after apply)%0A      + name                                      = "multi-tenant-network"%0A      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      + network_id                                = (known after apply)%0A      + numeric_id                                = (known after apply)%0A      + project                                   = "tmam-practical"%0A      + routing_mode                              = (known after apply)%0A      + self_link                                 = (known after apply)%0A    }%0A%0A  # module.tenant1.google_compute_firewall.this will be created%0A  + resource "google_compute_firewall" "this" {%0A      + creation_timestamp = (known after apply)%0A      + destination_ranges = (known after apply)%0A      + direction          = (known after apply)%0A      + enable_logging     = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "tenant1-fw"%0A      + network            = (known after apply)%0A      + priority           = 1000%0A      + project            = "tmam-practical"%0A      + self_link          = (known after apply)%0A      + source_ranges      = [%0A          + "0.0.0.0/0",%0A        ]%0A      + target_tags        = [%0A          + "tenant1-web",%0A        ]%0A%0A      + allow {%0A          + ports    = [%0A              + "22",%0A              + "80",%0A            ]%0A          + protocol = "tcp"%0A        }%0A    }%0A%0A  # module.tenant1.google_compute_instance.this will be created%0A  + resource "google_compute_instance" "this" {%0A      + can_ip_forward          = false%0A      + cpu_platform            = (known after apply)%0A      + creation_timestamp      = (known after apply)%0A      + current_status          = (known after apply)%0A      + deletion_protection     = false%0A      + effective_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "tenant"                     = "tenant1"%0A        }%0A      + id                      = (known after apply)%0A      + instance_id             = (known after apply)%0A      + label_fingerprint       = (known after apply)%0A      + labels                  = {%0A          + "tenant" = "tenant1"%0A        }%0A      + machine_type            = "e2-medium"%0A      + metadata                = {%0A          + "ssh-keys" = "gcpuser:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBLLvxDJJwCJq8uuKTlPmOI9sYvUo1dYjiVdazxSEbZ2+/uV1BHoXCdevUnfaBkD8eDbZ93M+PiNLoGhR5EnRPYM= abu@abu-VirtualBox"%0A        }%0A      + metadata_fingerprint    = (known after apply)%0A      + metadata_startup_script = <<-EOT%0A            #!/bin/bash -x%0A            exec > /var/log/startup-script.log 2>&1%0A            %0A            # Update system%0A            apt update%0A            apt upgrade -y%0A            %0A            # Install dependencies%0A            apt install -y gnupg2 ca-certificates lsb-release apt-transport-https software-properties-common curl unzip git%0A            %0A            # Add PHP repository (Sury, latest PHP packages)%0A            curl -fsSL https://packages.sury.org/php/apt.gpg | gpg --dearmor -o /etc/apt/trusted.gpg.d/sury.gpg%0A            echo "deb https://packages.sury.org/php $(lsb_release -sc) main" | tee /etc/apt/sources.list.d/php.list%0A            %0A            apt update%0A            apt upgrade -y%0A            %0A            # Install PHP + extensions + Nginx + Composer%0A            apt install -y nginx php8.3-cli php8.3-fpm php8.3-mbstring php8.3-mysql php8.3-xml php8.3-curl php8.3-sqlite3%0A            %0A            # Configure Nginx for Laravel%0A            cat > /etc/nginx/sites-available/laravel <<'EOF'%0A            server {%0A                listen 80;%0A                server_name _;%0A                root /var/www/laravel/public;%0A            %0A                add_header X-Frame-Options "SAMEORIGIN";%0A                add_header X-Content-Type-Options "nosniff";%0A            %0A                index index.php index.html;%0A            %0A                location / {%0A                    try_files $uri $uri/ /index.php?$query_string;%0A                }%0A            %0A                location ~ \.php$ {%0A                    include snippets/fastcgi-php.conf;%0A                    fastcgi_pass unix:/var/run/php/php8.3-fpm.sock;%0A                    fastcgi_param SCRIPT_FILENAME $document_root$fastcgi_script_name;%0A                    include fastcgi_params;%0A                }%0A            %0A                location ~ /\.ht {%0A                    deny all;%0A                }%0A            }%0A            EOF%0A            %0A            ln -s /etc/nginx/sites-available/laravel /etc/nginx/sites-enabled/%0A            rm -f /etc/nginx/sites-enabled/default%0A            %0A            # Install Composer globally%0A            export HOME=/root%0A            export COMPOSER_HOME=/root/.config/composer%0A            export COMPOSER_ALLOW_SUPERUSER=1%0A            mkdir -p /usr/src%0A            curl -sS https://getcomposer.org/installer -o /usr/src/composer-setup.php%0A            php /usr/src/composer-setup.php --install-dir=/usr/local/bin --filename=composer%0A            chmod 755 /usr/local/bin/composer%0A            %0A            # Verify Composer installation%0A            /usr/local/bin/composer --version%0A            %0A            # Deploy Laravel%0A            mkdir -p /var/www%0A            /usr/local/bin/composer create-project --prefer-dist --no-interaction laravel/laravel /var/www/laravel%0A            %0A            # Set permissions%0A            chown -R www-data:www-data /var/www/laravel%0A            chmod -R 755 /var/www/laravel%0A            %0A            # Restart services%0A            systemctl enable nginx php8.3-fpm%0A            systemctl restart nginx php8.3-fpm%0A        EOT%0A      + min_cpu_platform        = (known after apply)%0A      + name                    = "tenant1-webserver"%0A      + project                 = "tmam-practical"%0A      + self_link               = (known after apply)%0A      + tags                    = [%0A          + "tenant1-web",%0A        ]%0A      + tags_fingerprint        = (known after apply)%0A      + terraform_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "tenant"                     = "tenant1"%0A        }%0A      + zone                    = "us-central1-a"%0A%0A      + boot_disk {%0A          + auto_delete                = true%0A          + device_name                = (known after apply)%0A          + disk_encryption_key_sha256 = (known after apply)%0A          + guest_os_features          = (known after apply)%0A          + kms_key_self_link          = (known after apply)%0A          + mode                       = "READ_WRITE"%0A          + source                     = (known after apply)%0A%0A          + initialize_params {%0A              + architecture           = (known after apply)%0A              + image                  = "debian-cloud/debian-11"%0A              + labels                 = (known after apply)%0A              + provisioned_iops       = (known after apply)%0A              + provisioned_throughput = (known after apply)%0A              + resource_policies      = (known after apply)%0A              + size                   = (known after apply)%0A              + snapshot               = (known after apply)%0A              + type                   = (known after apply)%0A            }%0A        }%0A%0A      + network_interface {%0A          + internal_ipv6_prefix_length = (known after apply)%0A          + ipv6_access_type            = (known after apply)%0A          + ipv6_address                = (known after apply)%0A          + name                        = (known after apply)%0A          + network                     = (known after apply)%0A          + network_attachment          = (known after apply)%0A          + network_ip                  = (known after apply)%0A          + stack_type                  = (known after apply)%0A          + subnetwork                  = (known after apply)%0A          + subnetwork_project          = (known after apply)%0A%0A          + access_config {%0A              + nat_ip       = (known after apply)%0A              + network_tier = (known after apply)%0A            }%0A        }%0A    }%0A%0A  # module.tenant1.google_compute_subnetwork.this will be created%0A  + resource "google_compute_subnetwork" "this" {%0A      + creation_timestamp         = (known after apply)%0A      + enable_flow_logs           = (known after apply)%0A      + external_ipv6_prefix       = (known after apply)%0A      + fingerprint                = (known after apply)%0A      + gateway_address            = (known after apply)%0A      + id                         = (known after apply)%0A      + internal_ipv6_prefix       = (known after apply)%0A      + ip_cidr_range              = "10.0.1.0/24"%0A      + ipv6_cidr_range            = (known after apply)%0A      + ipv6_gce_endpoint          = (known after apply)%0A      + name                       = "tenant1-subnet"%0A      + network                    = (known after apply)%0A      + private_ip_google_access   = (known after apply)%0A      + private_ipv6_google_access = (known after apply)%0A      + project                    = "tmam-practical"%0A      + purpose                    = (known after apply)%0A      + region                     = "us-central1"%0A      + self_link                  = (known after apply)%0A      + stack_type                 = (known after apply)%0A      + state                      = (known after apply)%0A      + subnetwork_id              = (known after apply)%0A    }%0A%0A  # module.tenant2.google_compute_firewall.this will be created%0A  + resource "google_compute_firewall" "this" {%0A      + creation_timestamp = (known after apply)%0A      + destination_ranges = (known after apply)%0A      + direction          = (known after apply)%0A      + enable_logging     = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "tenant2-fw"%0A      + network            = (known after apply)%0A      + priority           = 1000%0A      + project            = "tmam-practical"%0A      + self_link          = (known after apply)%0A      + source_ranges      = [%0A          + "0.0.0.0/0",%0A        ]%0A      + target_tags        = [%0A          + "tenant2-web",%0A        ]%0A%0A      + allow {%0A          + ports    = [%0A              + "22",%0A              + "80",%0A            ]%0A          + protocol = "tcp"%0A        }%0A    }%0A%0A  # module.tenant2.google_compute_instance.this will be created%0A  + resource "google_compute_instance" "this" {%0A      + can_ip_forward          = false%0A      + cpu_platform            = (known after apply)%0A      + creation_timestamp      = (known after apply)%0A      + current_status          = (known after apply)%0A      + deletion_protection     = false%0A      + effective_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "tenant"                     = "tenant2"%0A        }%0A      + id                      = (known after apply)%0A      + instance_id             = (known after apply)%0A      + label_fingerprint       = (known after apply)%0A      + labels                  = {%0A          + "tenant" = "tenant2"%0A        }%0A      + machine_type            = "e2-medium"%0A      + metadata                = {%0A          + "ssh-keys" = "gcpuser:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBLLvxDJJwCJq8uuKTlPmOI9sYvUo1dYjiVdazxSEbZ2+/uV1BHoXCdevUnfaBkD8eDbZ93M+PiNLoGhR5EnRPYM= abu@abu-VirtualBox"%0A        }%0A      + metadata_fingerprint    = (known after apply)%0A      + metadata_startup_script = <<-EOT%0A            #!/bin/bash -x%0A            exec > /var/log/startup-script.log 2>&1%0A            %0A            # Update system%0A            apt update%0A            apt upgrade -y%0A            %0A            # Install dependencies%0A            apt install -y gnupg2 ca-certificates lsb-release apt-transport-https software-properties-common curl unzip git%0A            %0A            # Add PHP repository (Sury, latest PHP packages)%0A            curl -fsSL https://packages.sury.org/php/apt.gpg | gpg --dearmor -o /etc/apt/trusted.gpg.d/sury.gpg%0A            echo "deb https://packages.sury.org/php $(lsb_release -sc) main" | tee /etc/apt/sources.list.d/php.list%0A            %0A            apt update%0A            apt upgrade -y%0A            %0A            # Install PHP + extensions + Nginx + Composer%0A            apt install -y nginx php8.3-cli php8.3-fpm php8.3-mbstring php8.3-mysql php8.3-xml php8.3-curl php8.3-sqlite3%0A            %0A            # Configure Nginx for Laravel%0A            cat > /etc/nginx/sites-available/laravel <<'EOF'%0A            server {%0A                listen 80;%0A                server_name _;%0A                root /var/www/laravel/public;%0A            %0A                add_header X-Frame-Options "SAMEORIGIN";%0A                add_header X-Content-Type-Options "nosniff";%0A            %0A                index index.php index.html;%0A            %0A                location / {%0A                    try_files $uri $uri/ /index.php?$query_string;%0A                }%0A            %0A                location ~ \.php$ {%0A                    include snippets/fastcgi-php.conf;%0A                    fastcgi_pass unix:/var/run/php/php8.3-fpm.sock;%0A                    fastcgi_param SCRIPT_FILENAME $document_root$fastcgi_script_name;%0A                    include fastcgi_params;%0A                }%0A            %0A                location ~ /\.ht {%0A                    deny all;%0A                }%0A            }%0A            EOF%0A            %0A            ln -s /etc/nginx/sites-available/laravel /etc/nginx/sites-enabled/%0A            rm -f /etc/nginx/sites-enabled/default%0A            %0A            # Install Composer globally%0A            export HOME=/root%0A            export COMPOSER_HOME=/root/.config/composer%0A            export COMPOSER_ALLOW_SUPERUSER=1%0A            mkdir -p /usr/src%0A            curl -sS https://getcomposer.org/installer -o /usr/src/composer-setup.php%0A            php /usr/src/composer-setup.php --install-dir=/usr/local/bin --filename=composer%0A            chmod 755 /usr/local/bin/composer%0A            %0A            # Verify Composer installation%0A            /usr/local/bin/composer --version%0A            %0A            # Deploy Laravel%0A            mkdir -p /var/www%0A            /usr/local/bin/composer create-project --prefer-dist --no-interaction laravel/laravel /var/www/laravel%0A            %0A            # Set permissions%0A            chown -R www-data:www-data /var/www/laravel%0A            chmod -R 755 /var/www/laravel%0A            %0A            # Restart services%0A            systemctl enable nginx php8.3-fpm%0A            systemctl restart nginx php8.3-fpm%0A        EOT%0A      + min_cpu_platform        = (known after apply)%0A      + name                    = "tenant2-webserver"%0A      + project                 = "tmam-practical"%0A      + self_link               = (known after apply)%0A      + tags                    = [%0A          + "tenant2-web",%0A        ]%0A      + tags_fingerprint        = (known after apply)%0A      + terraform_labels        = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "tenant"                     = "tenant2"%0A        }%0A      + zone                    = "us-central1-b"%0A%0A      + boot_disk {%0A          + auto_delete                = true%0A          + device_name                = (known after apply)%0A          + disk_encryption_key_sha256 = (known after apply)%0A          + guest_os_features          = (known after apply)%0A          + kms_key_self_link          = (known after apply)%0A          + mode                       = "READ_WRITE"%0A          + source                     = (known after apply)%0A%0A          + initialize_params {%0A              + architecture           = (known after apply)%0A              + image                  = "debian-cloud/debian-11"%0A              + labels                 = (known after apply)%0A              + provisioned_iops       = (known after apply)%0A              + provisioned_throughput = (known after apply)%0A              + resource_policies      = (known after apply)%0A              + size                   = (known after apply)%0A              + snapshot               = (known after apply)%0A              + type                   = (known after apply)%0A            }%0A        }%0A%0A      + network_interface {%0A          + internal_ipv6_prefix_length = (known after apply)%0A          + ipv6_access_type            = (known after apply)%0A          + ipv6_address                = (known after apply)%0A          + name                        = (known after apply)%0A          + network                     = (known after apply)%0A          + network_attachment          = (known after apply)%0A          + network_ip                  = (known after apply)%0A          + stack_type                  = (known after apply)%0A          + subnetwork                  = (known after apply)%0A          + subnetwork_project          = (known after apply)%0A%0A          + access_config {%0A              + nat_ip       = (known after apply)%0A              + network_tier = (known after apply)%0A            }%0A        }%0A    }%0A%0A  # module.tenant2.google_compute_subnetwork.this will be created%0A  + resource "google_compute_subnetwork" "this" {%0A      + creation_timestamp         = (known after apply)%0A      + enable_flow_logs           = (known after apply)%0A      + external_ipv6_prefix       = (known after apply)%0A      + fingerprint                = (known after apply)%0A      + gateway_address            = (known after apply)%0A      + id                         = (known after apply)%0A      + internal_ipv6_prefix       = (known after apply)%0A      + ip_cidr_range              = "10.0.2.0/24"%0A      + ipv6_cidr_range            = (known after apply)%0A      + ipv6_gce_endpoint          = (known after apply)%0A      + name                       = "tenant2-subnet"%0A      + network                    = (known after apply)%0A      + private_ip_google_access   = (known after apply)%0A      + private_ipv6_google_access = (known after apply)%0A      + project                    = "tmam-practical"%0A      + purpose                    = (known after apply)%0A      + region                     = "us-central1"%0A      + self_link                  = (known after apply)%0A      + stack_type                 = (known after apply)%0A      + state                      = (known after apply)%0A      + subnetwork_id              = (known after apply)%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + tenant1_instance_ip = (known after apply)%0A  + tenant2_instance_ip = (known after apply)%0A
::debug::stderr: 2025-10-02T13:31:09.935Z [INFO]  Terraform version: 1.6.6%0A2025-10-02T13:31:09.935Z [INFO]  Go runtime version: go1.21.5%0A2025-10-02T13:31:09.935Z [INFO]  CLI args: []string{"/home/runner/work/_temp/f2c03f31-01f7-4a5f-8693-c1193944e9a5/terraform-bin", "show", "-no-color", "tfplan"}%0A2025-10-02T13:31:09.935Z [INFO]  CLI command args: []string{"show", "-no-color", "tfplan"}%0A2025-10-02T13:31:10.030Z [INFO]  provider: configuring client automatic mTLS%0A2025-10-02T13:31:10.073Z [INFO]  provider.terraform-provider-google_v6.50.0_x5: configuring server automatic mTLS: timestamp=2025-10-02T13:31:10.073Z%0A
::debug::exitcode: 0

```

</details>
